{"hed":"You are Gianni, age 18, from Italy","dek":"YEAR. As a fisherman in Sicily, you can barely make ends meet — and can’t imagine supporting a family. Your two brothers already live in the U.S. and encourage you to join them. You don’t know a word of English. But you decide to make a move.","connections":[{"title":"You are Gianni, age 18, from Italy","id":"Gianni-1","img":"assets/images/1.jpg","text":[{"type":"text","value":"YEAR. As a fisherman in Sicily, you can barely make ends meet — and can’t imagine supporting a family. Your two brothers already live in the U.S. and encourage you to join them. You don’t know a word of English. But you decide to make a move."}],"btn":[{"text":"Next: The journey…","next":"Gianni-2"}]},{"title":"The journey & arrival","id":"Gianni-2","img":"assets/images/2.jpg","text":[{"type":"text","value":"1910."},{"type":"text","value":"You take a train (check) to Cherbourg, France and embark on a 10-day steamship journey to New York."},{"type":"text","value":"At Ellis Island, you present [TK evidence], and, like most immigrants at this time, you are permitted to enter. No visa is required."}],"btn":[{"text":"Next: Settlement…","next":"Gianni-3"}]},{"title":"Back and forth","id":"Gianni-3","img":"assets/images/3.jpg","text":[{"type":"text","value":"1914. Like many young Italian men at this time, you are a “bird of passage” — living in New York, saving money, returning to Italy, and re-emigrating to the U.S."},{"type":"text","value":"One one trip back to Sicily, you meet Lucia and fall deeply in love. You leave again for New York but promise to marry her the next time you return."}],"btn":[{"text":"Next: Making a life…","next":"Gianni-4"}]},{"title":"Love takes a detour","id":"Gianni-4","img":"assets/images/1.jpg","text":[{"type":"text","value":"“1916. World War I has broken out and you don’t know when you’ll be able to go back to Italy. In New York, you meet Sofia, the U.S.-born daughter of an Italian immigrant."},{"type":"text","value":"Sofia’s father owns a thriving fishmonger business, and hints that he’ll give you a job if you marry Sofia. It’s not true love, but it’s security and a possibly-lucrative future."},{"type":"text","value":"Do you …"}],"btn":[{"text":"Marry Sofia and seek economic security","next":"Gianni-4-1"},{"text":"Wait for your true love Lucia, no matter the consequences","next":"Gianni-4-2"}]},{"title":"New city, new name","id":"Gianni-4-1","img":"assets/images/2.jpg","text":[{"type":"text","value":"1921. [???] You marry Sofia and start a job in her father’s business. But her father dies unexpectedly and her family loses the store. You, Sofia, and your two children move to Boston to join your brother."},{"type":"text","value":"You arrive in the city as Italian anarchists Sacco and Vanzetti stand trial for murder. Facing post-war isolationism and hostility towards immigrants, you have to choose how much to assimilate. Should you …"}],"btn":[{"text":"Stay with your brother in Boston’s North End, an Italian neighborhood","next":"Gianni-4-1-1"},{"text":"Move the family to Charlestown, where fewer Italians live","next":"Gianni-4-1-2"}]},{"title":"New city, new name","id":"Gianni-4-1-1","img":"assets/images/3.jpg","text":[{"type":"text","value":"1917 [???] You move to your brother’s Italian neighborhood, get involved in a Catholic parish, and join the local chapter of the Order of the Sons of Italy in America. Your ethnic connections help as you start your own fishmonger business."}],"btn":[{"text":"Next: News from home…","next":"Gianni-5"}]},{"title":"Starting over… again","id":"Gianni-4-1-2","img":"assets/images/1.jpg","text":[{"type":"text","value":"You change your name to James and moves your family to Charlestown, where fewer Italians live. You find steady work as a fisherman, but don’t come closer to your dream of owning your own fishmonger business."}],"btn":[{"text":"Next: News from home…","next":"Gianni-5"}]},{"title":"A wedding in sicily","id":"Gianni-4-2","img":"assets/images/2.jpg","text":[{"type":"text","value":"1919. You return to Italy and marry Lucia. Soon, she is pregnant. You move back to New York, promising you’ll bring her over once you’ve secured a job and a home."}],"btn":[{"text":"Next: A reunion delayed…","next":"Gianni-4-3"}]},{"title":"A reunion delayed","id":"Gianni-4-3","img":"assets/images/3.jpg","text":[{"type":"text","value":"Summer, 1921: You are ready to summon Lucia  With an apartment in Little Italy and a steady job at TK, you are ready to summon Lucia and your infant son, Roberto. But immigration law has changed. Under the Emergency Quota Act (EQA) of 1921, each country gets a maximum number of immigrants. Visas are given on a first-come-first-served basis at the port of entry, and the number of Italians seeking entry far exceed the quota."},{"type":"text","value":"If Lucia and Roberto make the passage, they might get turned away."}],"btn":[{"text":"Send for you wife and son anyway","next":"Gianni-4-3-1"},{"text":"Stay separated and wait until you’re a citizen","next":"Gianni-4-4-1"}]},{"title":"The door is closed","id":"Gianni-4-3-1","img":"assets/images/1.jpg","text":[{"type":"text","value":"February, 1922: Lucia and Roberto arrive in New York, but their ship is held in the harbor. The Italian quotas have already been filled for the year. The boat returns to Italy."},{"type":"text","value":"Now, your best chance of reuniting with Lucia is to become a citizen — which would allow you to bring your wife and child into the country, regardless of quotas. But the process could take five to six years from your last entry to the U.S. in 1919."}],"btn":[{"text":"Next: reunited…","next":"Gianni-4-4-1"}]},{"title":"Reunited","id":"Gianni-4-4-1","img":"assets/images/2.jpg","text":[{"type":"1926","value":"You move to Boston’s North End to be live near your brother, work as a fisherman there, and are naturalized (details TK). Finally, you apply for visas for your family. In early 1927, Lucia and a now 6-year-old Roberto join you in Boston."}],"btn":[{"text":"Next: THE END…","next":"Gianni-6"}]},{"title":"News from home","id":"Gianni-5","img":"assets/images/3.jpg","text":[{"type":"1925","value":"A telegram arrives from Italy. Your father has died. Your aging mother is alone; all of her sons are in America. Influenza is coursing through her village and you worry for her health."},{"type":"text","value":"You want to visit her, but there’s a risk that you might not be able to return. The Immigration and Nationality Act of 1924 sets quotas for entry into the U.S. from each country. Being married to a citizen would help ensure reentry. But under the Cable Act of 1922, U.S.-born Sofia lost her citizenship because she married an immigrant — you."},{"type":"text","value":"Should you …"}],"btn":[{"text":"Go to Italy, even though you might not be able to return","next":"Gianni-5-1"},{"text":"Stay in Boston until you become a citizen, and hope that your mother survives","next":"Gianni-5-2"}]},{"title":"Stuck in italy","id":"Gianni-5-1","img":"assets/images/1.jpg","text":[{"type":"text","value":"1926. You go to Italy and care for your mother. But when you try to return to the U.S.  several months later, you can’t get a visa. You stay in Italy until 1926, when Sofia can finally naturalize and apply to bring you back."}],"btn":[{"text":"Next: The end of the journey…","next":"Gianni-6"}]},{"title":"Stuck in italy","id":"Gianni-5-2","img":"assets/images/2.jpg","text":[{"type":"text","value":"You stay in Boston and send your mother money — making it harder for you to support your own wife and children. Finally, in early 1926, you become a citizen, but your mother dies before you can get back to Italy."}],"btn":[{"text":"Next: The end of the journey…","next":"Gianni-6"}]},{"title":"The end","id":"Gianni-6","img":"assets/images/3.jpg","text":[{"type":"text","value":"Summarize journey to citizenship??? Future glimpse of family tree?"}],"btn":[{"text":"Start over as Gianni","next":"Gianni-1"},{"text":"Start over as someone else","next":"‘#’"}]}]}